# THIS FILE IS AUTOMATICALLY GENERATED
# Project: G:\DSA\PORIGE\Workspace03\Design01.cydsn\Design01.cyprj
# Date: Thu, 19 Apr 2018 11:54:16 GMT
#set_units -time ns
create_clock -name {CyBUS_CLK(routed)} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/clk_bus}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 9} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {ADC_Channel1_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 31 61} [list [get_pins {ClockBlock/aclk_glb_0}]]


# Component constraints for G:\DSA\PORIGE\Workspace03\Design01.cydsn\TopDesign\TopDesign.cysch
# Project: G:\DSA\PORIGE\Workspace03\Design01.cydsn\Design01.cyprj
# Date: Thu, 19 Apr 2018 11:54:05 GMT
